import { PrismaClient } from '@prisma/client';

export async function seedRequirements(prisma: PrismaClient) {
    // ข้อกำหนดของรายการตรวจต่างๆ
    const requirements = [
        {
            id: 1,
            itemId: 1, // รายการตรวจ ที่ 1 : น้ำ ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 1,
            name: 'หากไม่ใช่น้ำฝน ต้องมาจากแหล่งที่ไม่มีการปนเปื้อนวัตถุอันตราย',
            level: 'ข้อกำหนดรอง',
            levelNo: '1.1'
        },
        {
            id: 2,
            itemId: 1, // รายการตรวจ ที่ 1 : น้ำ ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 2,
            name: 'มีการอนุรักษ์แหล่งน้ำ และสภาพแวดล้อม',
            level: 'ข้อแนะนำ',
            levelNo: '1.2'
        },
        {
            id: 3,
            itemId: 1, // รายการตรวจ ที่ 1 : น้ำ ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 3,
            name: 'เลือกแหล่งปลูกที่มีน้ำเพียงพอในการผลิตพืชให้มีคุณภาพ',
            level: 'ข้อแนะนำ',
            levelNo: '1.3'
        },
        {
            id: 4,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 1,
            name: 'พื้นที่ปลูกไม่มีการตกค้างของวัตถุอันตรายที่ส่งผลกระทบต่อการเจริญเติบโตของต้นยาง',
            level: 'ข้อกำหนดหลัก',
            levelNo: '2.1'
        },
        {
            id: 5,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 2,
            name: 'สภาพพื้นที่เป็นพื้นที่ราบหรือมีความลาดชันต่ำกว่า 35 องศา ถ้าความลาดชันเกิน 15 องศา ต้องทำขั้นบันได ความสูงจากระดับน้ำทะเลไม่เกิน 600 เมตร',
            level: 'ข้อกำหนดหลัก',
            levelNo: '2.2'
        },
        {
            id: 6,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 3,
            name: 'หน้าดินควรมีความลึกไม่น้อยกว่า 1 เมตร ไม่เป็นพื้นที่ที่มีน้ำท่วมขัง หรือชั้นกรวดอัดแน่นในระดับต่ำกว่าผิวดิน 1 เมตร ดินมีการระบายน้ำดี',
            level: 'ข้อกำหนดหลัก',
            levelNo: '2.3'
        },
        {
            id: 7,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 4,
            name: 'ค่าความเป็นกรด - ด่าง (pH) ที่เหมาะสมอยู่ระหว่าง 4.5 - 5.5 ไม่เป็นดินเค็ม หรือดินเกลือ',
            level: 'ข้อกำหนดรอง',
            levelNo: '2.4'
        },
        {
            id: 8,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 5,
            name: 'พื้นที่ปลูกควรมีปริมาณน้ำฝนไม่ต่ำกว่า 1,200 มิลลิเมตรต่อปี จำนวนวันฝนตกเฉลี่ย 120-150 วัน และมีช่วงฤดูแล้งต่อเนื่องไม่เกิน 5 เดือน',
            level: 'ข้อกำหนดรอง',
            levelNo: '2.5'
        },
        {
            id: 9,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 6,
            name: 'พื้นที่ปลูกใหม่ ควรเป็นพื้นที่ที่ไม่ก่อให้เกิดผลกระทบต่อสิ่งแวดล้อม หากมีผลกระทบ ควรมีมาตรการในการลดหรือป้องกันผลเสียที่จะเกิดขึ้น',
            level: 'ข้อกำหนดรอง',
            levelNo: '2.6'
        },
        {
            id: 10,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 7,
            name: 'การจัดทำรหัสแปลงปลูก และข้อมูลประจำแปลง โดยระบุ ชื่อเจ้าของพื้นที่ สถานที่ติดต่อ ชื่อผู้ดูแล (ถ้ามี) ที่ติดตั้งแปลง แผนผังที่ตั้งแปลง แผนผังแปลงปลูก และพันธุ์ที่ปลูก',
            level: 'ข้อกำหนดรอง',
            levelNo: '2.7'
        },
        {
            id: 11,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 8,
            name: 'จัดทำประวัติการใช้ที่ดินย้อนหลังอย่างน้อย 2 ปี',
            level: 'ข้อแนะนำ',
            levelNo: '2.8'
        },
        {
            id: 12,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 1,
            name: 'ใช้วัตถุอันตรายที่ขึ้นทะเบียนถูกต้องตามกฎหมาย มีเลขทะเบียนวัตถุอันตราย และมีคำแนะนำบนฉลาก ไม่ใช้วัตถุอันตรายทางการเกษตรที่ห้ามผลิต นำเข้า ส่งออก หรือการมีไว้ในครอบครองตามพระราชบัญญัติวัตถุอันตราย พ.ศ. 2562',
            level: 'ข้อกำหนดรอง',
            levelNo: '3.1'
        },
        {
            id: 13,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 2,
            name: 'ทำความสะอาดเครื่องพ่นวัตถุอันตรายทางการเกษตรและอุปกรณ์หลังการใช้ทุกครั้ง และกำจัดน้ำล้างด้วยวิธีที่ไม่ทำให้เกิดการปนเปื้อนสู่สิ่งแวดล้อม',
            level: 'ข้อแนะนำ',
            levelNo: '3.2'
        },
        {
            id: 14,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 3,
            name: 'ผู้ปฏิบัติงาน และ/หรือผู้ควบคุมต้องมีความรู้ในการใช้วัตถุอันตรายทางการเกษตรที่ถูกต้อง รู้จักศัตรูพืช ชนิดและอัตราการใช้เครื่องพ่นวัตถุอันตรายทางการเกษตร และอุปกรณ์ที่เกี่ยวข้อง',
            level: 'ข้อแนะนำ',
            levelNo: '3.3'
        },
        {
            id: 15,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 4,
            name: 'เลือกใช้เครื่องพ่นวัตถุอันตรายทางการเกษตรและอุปกรณื หัวฉีด วิธีการพ่นที่ถูกต้อง โดยตรวจสอบให้อยู่ในสภาพที่พร้อมจะใช้งานได้อย่างมีประสิทธิภาพ',
            level: 'ข้อแนะนำ',
            levelNo: '3.4'
        },
        {
            id: 16,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 5,
            name: 'วัตถุอันตรายทางการเกษตรที่ใช้ไม่หมดในคราวเดียว ต้องปิดฝาให้สนิทและเก็บในสถานที่เก็บวัตถุอันตรายทางการเกษตร หากเปลี่ยนถ่ายภาชนะบรรจุต้องระบุข้อมูลให้ครบถ้วนถูกต้อง',
            level: 'ข้อแนะนำ',
            levelNo: '3.5'
        },
        {
            id: 17,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 6,
            name: 'จัดเก็บวัตถุอันตรายทางการเกษตรชนิดต่างๆ ในสถานที่เฉพาะที่เป็นสัดส่วน แยกสารแต่ละชนิด ควบคุมการหยิบใช้ได้ และไม่ทำให้เกิดการปนเปื้อนสู่ผลิตผลและไม่เกิดอันตรายต่อบุคคล',
            level: 'ข้อแนะนำ',
            levelNo: '3.6'
        },
        {
            id: 18,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 7,
            name: 'ภาชนะบรรจุวัตถุอันตรายทางการเกษตรที่ใช้หมดแล้ว ต้องทำลาย หรือกำจัดด้วยวิธีที่ถูกต้อง',
            level: 'ข้อแนะนำ',
            levelNo: '3.7'
        },
        {
            id: 19,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 8,
            name: 'ผู้ปฏิบัติงานควรมีความรู้ในการป้องกันตนเองจากการใช้วัตถุอันตรายทางการเกษตร และการปฐมพยาบาลเบื้องต้น',
            level: 'ข้อแนะนำ',
            levelNo: '3.8'
        },
        {
            id: 20,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 9,
            name: 'มีเอกสารข้อมูลเกี่ยวกับวัตถุอันตรายทางการเกษตรที่ใช้ ห้ามใช้ในประเทศและประเทศคู่ค้า',
            level: 'ข้อแนะนำ',
            levelNo: '3.9'
        },
        {
            id: 21,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 10,
            name: 'ไม่ใช้วัตถุอันตรายทางการเกษตรมากกว่าสองชนิดผสมกันเว้นแต่จะเป็นคำแแนะนำของหน่วยราชการที่เกี่ยวข้องหรือข้อมูลทางวิชาการรับรอง',
            level: 'ข้อแนะนำ',
            levelNo: '3.10'
        },
        {
            id: 22,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 11,
            name: 'มีการใช้ระบบการจัดการศัตรูพืชแบบผสมผสานที่เหมาะสม',
            level: 'ข้อแนะนำ',
            levelNo: '3.11'
        },
        {
            id: 23,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 12,
            name: 'จัดเก็บวัตถุอันตรายทางการเกษตรอื่น เช่น น้ำมันเชื้อเพลิง สารทำความสะอาด สารอื่นๆ ที่ไม่ได้ใช้ทางการเกษตร ให้เก็บเป็นสัดส่วนเพื่อป้องกันการปนเปื้อนสู่ผลิตผลและสิ่งแวดล้อม',
            level: 'ข้อแนะนำ',
            levelNo: '3.12'
        },
        {
            id: 24,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 13,
            name: 'มีการบันทึกรายการหรือจัดทำบัญชีรายชื่อวัตถุอันตรายทางการเกษตร ที่เก็บไว้ในสถานที่เก็บ',
            level: 'ข้อแนะนำ',
            levelNo: '3.13'
        },
        {
            id: 25,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 14,
            name: 'ผู้พ่นวัตถุอันตรายทางการเกษตรต้องอยู่เหนือลมตลอดเวลา รวมถึงต้องระวังละอองวัตถุอันตรายทางการเกษตรฟุ้งกระจายไปปนเปื้อนแปลงใกล้เคียงและสิ่งแวดล้อม',
            level: 'ข้อแนะนำ',
            levelNo: '3.14'
        },
        {
            id: 26,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 15,
            name: 'มีเอกสารคำแนะนำการปฏิบัติกรณีที่มีอุบัติเหตุหรือเหตุฉุกเฉินแสดงไว้ให้เห็นชัดเจนในบริเวณเก็บวัตถุอันตรายทางการเกษตร',
            level: 'ข้อแนะนำ',
            levelNo: '3.15'
        },
        {
            id: 27,
            itemId: 4, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตก่อนการเปิดกรีด
            requirementNo: 1,
            name: 'พันธุ์ยางต้องเป็นพันธุ์ที่สถาบันวิจัยยางแนะนำตั้งแต่ปี 2554 ถึงปัจจุบัน',
            level: 'ข้อกำหนดหลัก',
            levelNo: '4.1'
        },
        {
            id: 28,
            itemId: 4, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตก่อนการเปิดกรีด
            requirementNo: 2,
            name: 'วัสดุปลูก - ต้นยางชำถุง วัสดุปลูกที่ได้จากการนำต้นตอตาเขียวมาปลูกในถุง หรือได้จาการเพาะเมล็ดในถุงแล้วติดตาในถุงจนได้ต้นยางชำถุงขนาด 1-2 ฉัตร - ต้นติดตาในแปลง การปลูกด้วยเมล็ด แล้วติดตาด้วยพันธุ์ยางที่สถาบันวิจัยยางแนะนำ',
            level: 'ข้อกำหนดหลัก',
            levelNo: '4.2'
        },
        {
            id: 29,
            itemId: 4, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตก่อนการเปิดกรีด
            requirementNo: 3,
            name: 'การเตรียมดิน - เตรียมดินโดยโค่นและทำลายเศษซากพืชเดิมที่เหลือในแปลงให้สะอาด เพื่อป้องกันไม่ให้เศษซากพืชเป็นแหล่งที่อยู่อาศัยของเชื้อโรค - วางแนวปลูกตามระยะที่แนะนำ',
            level: 'ข้อกำหนดรอง',
            levelNo: '4.3'
        },
        {
            id: 30,
            itemId: 4, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตก่อนการเปิดกรีด
            requirementNo: 4,
            name: 'ใช้ระยะปลูกตามคำแนะนำของสถาบันวิจัยยาง',
            level: 'ข้อกำหนดหลัก',
            levelNo: '4.4'
        },
        {
            id: 31,
            itemId: 4, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตก่อนการเปิดกรีด
            requirementNo: 5,
            name: 'ขนาดของหลุมที่ใช้ปลูกมีความกว้าง ยาว และลึก เท่ากับ 50x50x50 ซม.',
            level: 'ข้อกำหนดรอง',
            levelNo: '4.5'
        },
        {
            id: 32,
            itemId: 4, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตก่อนการเปิดกรีด
            requirementNo: 6,
            name: 'กรณีการปลูกยางด้วยต้นยางชำถุง - ปลูกด้วยยางชำถุงขนาด 1-2 ฉัตร กรณีการปลูกด้วยการติดตาในแปลง - ปลูกด้วยเมล็ดหรือเมล็ดงอก (ตีนตุ๊กแก) หลุมละ 3 เมล็ด แล้วติดตาด้วยพันธุ์ยางที่สถาบันวิจัยยางแนะนำ',
            level: 'ข้อกำหนดรอง',
            levelNo: '4.6'
        },
        {
            id: 33,
            itemId: 4, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตก่อนการเปิดกรีด
            requirementNo: 7,
            name: 'ความสม่ำเสมอของต้นยางและจำนวนต้นรอดตาย ไม่น้อยกว่า ร้อยละ 80',
            level: 'ข้อกำหนดหลัก',
            levelNo: '4.7'
        },
        {
            id: 34,
            itemId: 4, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตก่อนการเปิดกรีด
            requirementNo: 8,
            name: 'ตัดแต่งกิ่งตั้งแต่ยางอายุ 6 เดือน ให้ทยอยตัดแต่งกิ่งที่ต่ำกว่า 1 เมตร ยางอายุ 1 ปี ขึ้นไป ตัดแต่งกิ่งในระดับต่ำกว่า 2 เมตร',
            level: 'ข้อกำหนดหลัก',
            levelNo: '4.8'
        },
        {
            id: 35,
            itemId: 4, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตก่อนการเปิดกรีด
            requirementNo: 9,
            name: 'มีการคลุมโคนช่วงปลายฤดูฝนเพื่อรักษาความชื้นในดินในชวงฤดูแล้ง',
            level: 'ข้อกำหนดรอง',
            levelNo: '4.9'
        },
        {
            id: 36,
            itemId: 4, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตก่อนการเปิดกรีด
            requirementNo: 10,
            name: 'การป้องกันรอยไหม้ของลำต้นจากแสงแดดในช่วงฤดูแล้ง',
            level: 'ข้อกำหนดรอง',
            levelNo: '4.10'
        },
        {
            id: 37,
            itemId: 4, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตก่อนการเปิดกรีด
            requirementNo: 11,
            name: 'การควบคุมและกำจัดวัชพืชเพื่อลดผลกระทบต่อการเจริญเติบโตของต้นยาง',
            level: 'ข้อกำหนดหลัก',
            levelNo: '4.11'
        },
        {
            id: 38,
            itemId: 4, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตก่อนการเปิดกรีด
            requirementNo: 12,
            name: 'ใช้สูตรปู่ย และอัตราปู่ยที่แนะนำสำหรับยางพารา เป็นสูตรปุ๋ยทั่วไปเหมาะสำหรับดินที่เป็นตัวแทนส่วนใหญ่ของประเทศ - อัตราปุ๋ยที่แนะนำให้ใส่แตกต่างกันตามชนิดของเนื้อดิน และอายุของต้นยาง',
            level: 'ข้อกำหนดหลัก',
            levelNo: '4.12'
        },
        {
            id: 39,
            itemId: 4, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตก่อนการเปิดกรีด
            requirementNo: 13,
            name: 'ส่วนของพืชที่มีโรคเข้าทำลาย ต้องเผาทำลายนอกแปลงปลูก โดยไม่มีผลกระทบต่อสิ่งแวดล้อม',
            level: 'ข้อแนะนำ',
            levelNo: '4.13'
        },
        {
            id: 40,
            itemId: 4, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตก่อนการเปิดกรีด
            requirementNo: 14,
            name: 'แยกประเภทของเสีย และสิ่งของที่ไม่ใช้/ไม่เกี่ยวข้องกับผลิตให้ชัดเจน มีที่ทิ้งขยะเพียงพอหรือระบุจุดทิ้ง รวมถึงมีการลดของเสียที่เกิดขึ้นในกระบวนการผลิต',
            level: 'ข้อแนะนำ',
            levelNo: '4.14'
        },
        {
            id: 41,
            itemId: 5, // รายการตรวจ ที่ 5 : สุขลักษณะส่วนบุคคล
            requirementNo: 1,
            name: 'ผู้ใช้วัตถุอันตรายทางการเกษตรต้องสวมเสื้อผ้ามิดชิดมีอุปรกรณ์ป้องกันสารพิษ ได้แก่ หน้ากาก ผ้าปิดจมูก ถุงมือ หมวก และสวมรองเท้า',
            level: 'ข้อแนะนำ',
            levelNo: '5.1'
        },
        {
            id: 42,
            itemId: 5, // รายการตรวจ ที่ 5 : สุขลักษณะส่วนบุคคล
            requirementNo: 2,
            name: 'ต้องอาบน้ำ สระผม และเปลี่ยนเสื้อผ้าทันทีหลังพ่นวัตถุอันตรายทางการเกษตรและต้องนำเสื้อผ้าไปซักให้สะอาดทุกครั้งโดยซักแยกจากเสื้อผ้าที่ใช้ปกติ',
            level: 'ข้อแนะนำ',
            levelNo: '5.2'
        },
        {
            id: 43,
            itemId: 5, // รายการตรวจ ที่ 5 : สุขลักษณะส่วนบุคคล
            requirementNo: 3,
            name: 'มีอุปกรณ์ปฐมพยาบาล และอุปกรณ์ป้องกันอุบัติเหตุอย่างครบถ้วน เช่น น้ำยาล้างตา น้ำสะอาด ทราย ฯลฯ',
            level: 'ข้อแนะนำ',
            levelNo: '5.3'
        },
        {
            id: 45,
            itemId: 6, // รายการตรวจ ที่ 6 : การบันทึกและการจัดเก็บข้อมูล
            requirementNo: 1,
            name: 'ต้องบันทึกข้อมูลการปฏิบัติงานและการจัดการฯ การผลิตทุกขั้นตอน',
            level: 'ข้อกำหนดหลัก',
            levelNo: '6.1'
        }, {
            id: 46,
            itemId: 7, // รายการตรวจ ที่ 1 : น้ำ ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 1,
            name: 'หากไม่ใช่น้ำฝน ต้องมาจากแหล่งที่ไม่มีการปนเปื้อนวัตถุอันตราย',
            level: 'ข้อกำหนดรอง',
            levelNo: '1.1'
        },
        {
            id: 47,
            itemId: 7, // รายการตรวจ ที่ 1 : น้ำ ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 2,
            name: 'มีการอนุรักษ์แหล่งน้ำ และสภาพแวดล้อม',
            level: 'ข้อแนะนำ',
            levelNo: '1.2'
        },
        {
            id: 48,
            itemId: 7, // รายการตรวจ ที่ 1 : น้ำ ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 3,
            name: 'เลือกแหล่งปลูกที่มีน้ำเพียงพอในการผลิตพืชให้มีคุณภาพ',
            level: 'ข้อแนะนำ',
            levelNo: '1.3'
        },
        {
            id: 49,
            itemId: 8, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 1,
            name: 'พื้นที่ปลูกไม่มีการตกค้างของวัตถุอันตรายที่ส่งผลกระทบต่อการเจริญเติบโตของต้นยาง',
            level: 'ข้อกำหนดหลัก',
            levelNo: '2.1'
        },
        {
            id: 50,
            itemId: 8, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 2,
            name: 'สภาพพื้นที่เป็นพื้นที่ราบหรือมีความลาดชันต่ำกว่า 35 องศา ถ้าความลาดชันเกิน 15 องศา ต้องทำขั้นบันได ความสูงจากระดับน้ำทะเลไม่เกิน 600 เมตร',
            level: 'ข้อกำหนดรอง',
            levelNo: '2.2'
        },
        {
            id: 51,
            itemId: 8, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 3,
            name: 'หน้าดินควรมีความลึกไม่น้อยกว่า 1 เมตร ไม่เป็นพื้นที่ที่มีน้ำท่วมขัง หรือชั้นกรวดอัดแน่นในระดับต่ำกว่าผิวดิน 1 เมตร ดินมีการระบายน้ำดี',
            level: 'ข้อกำหนดรอง',
            levelNo: '2.3'
        },
        {
            id: 52,
            itemId: 8, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 4,
            name: 'ค่าความเป็นกรด - ด่าง (pH) ที่เหมาะสมอยู่ระหว่าง 4.5 - 5.5 ไม่เป็นดินเค็ม หรือดินเกลือ',
            level: 'ข้อกำหนดรอง',
            levelNo: '2.4'
        },
        {
            id: 53,
            itemId: 8, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 5,
            name: 'พื้นที่ปลูกควรมีปริมาณน้ำฝนไม่ต่ำกว่า 1,200 มิลลิเมตรต่อปี จำนวนวันฝนตกเฉลี่ย 120-150 วัน และมีช่วงฤดูแล้งต่อเนื่องไม่เกิน 5 เดือน',
            level: 'ข้อกำหนดรอง',
            levelNo: '2.5'
        },
        {
            id: 52,
            itemId: 8, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 6,
            name: 'พื้นที่ปลูกใหม่ ควรเป็นพื้นที่ที่ไม่ก่อให้เกิดผลกระทบต่อสิ่งแวดล้อม หากมีผลกระทบ ควรมีมาตรการในการลดหรือป้องกันผลเสียที่จะเกิดขึ้น',
            level: 'ข้อกำหนดรอง',
            levelNo: '2.6'
        },
        {
            id: 54,
            itemId: 8, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 7,
            name: 'การจัดทำรหัสแปลงปลูก และข้อมูลประจำแปลง โดยระบุ ชื่อเจ้าของพื้นที่ สถานที่ติดต่อ ชื่อผู้ดูแล (ถ้ามี) ที่ติดตั้งแปลง แผนผังที่ตั้งแปลง แผนผังแปลงปลูก และพันธุ์ที่ปลูก',
            level: 'ข้อกำหนดรอง',
            levelNo: '2.7'
        },
        {
            id: 55,
            itemId: 8, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 8,
            name: 'จัดทำประวัติการใช้ที่ดินย้อนหลังอย่างน้อย 2 ปี',
            level: 'ข้อแนะนำ',
            levelNo: '2.8'
        },

        {
            id: 56,
            itemId: 9, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 1,
            name: 'ใช้วัตถุอันตรายที่ขึ้นทะเบียนถูกต้องตามกฎหมาย มีเลขทะเบียนวัตถุอันตราย และมีคำแนะนำบนฉลาก ไม่ใช้วัตถุอันตรายทางการเกษตรที่ห้ามผลิต นำเข้า ส่งออก หรือการมีไว้ในครอบครองตามพระราชบัญญัติวัตถุอันตราย พ.ศ. 2562',
            level: 'ข้อกำหนดรอง',
            levelNo: '3.1'
        },
        {
            id: 57,
            itemId: 9, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 2,
            name: 'ทำความสะอาดเครื่องพ่นวัตถุอันตรายทางการเกษตรและอุปกรณ์หลังการใช้ทุกครั้ง และกำจัดน้ำล้างด้วยวิธีที่ไม่ทำให้เกิดการปนเปื้อนสู่สิ่งแวดล้อม',
            level: 'ข้อแนะนำ',
            levelNo: '3.2'
        },
        {
            id: 58,
            itemId: 9, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 3,
            name: 'ผู้ปฏิบัติงาน และ/หรือผู้ควบคุมต้องมีความรู้ในการใช้วัตถุอันตรายทางการเกษตรที่ถูกต้อง รู้จักศัตรูพืช ชนิดและอัตราการใช้เครื่องพ่นวัตถุอันตรายทางการเกษตร และอุปกรณ์ที่เกี่ยวข้อง',
            level: 'ข้อแนะนำ',
            levelNo: '3.3'
        },
        {
            id: 59,
            itemId: 9, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 4,
            name: 'เลือกใช้เครื่องพ่นวัตถุอันตรายทางการเกษตรและอุปกรณื หัวฉีด วิธีการพ่นที่ถูกต้อง โดยตรวจสอบให้อยู่ในสภาพที่พร้อมจะใช้งานได้อย่างมีประสิทธิภาพ',
            level: 'ข้อแนะนำ',
            levelNo: '3.4'
        },
        {
            id: 60,
            itemId: 9, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 5,
            name: 'วัตถุอันตรายทางการเกษตรที่ใช้ไม่หมดในคราวเดียว ต้องปิดฝาให้สนิทและเก็บในสถานที่เก็บวัตถุอันตรายทางการเกษตร หากเปลี่ยนถ่ายภาชนะบรรจุต้องระบุข้อมูลให้ครบถ้วนถูกต้อง',
            level: 'ข้อแนะนำ',
            levelNo: '3.5'
        },
        {
            id: 61,
            itemId: 9, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 6,
            name: 'จัดเก็บวัตถุอันตรายทางการเกษตรชนิดต่างๆ ในสถานที่เฉพาะที่เป็นสัดส่วน แยกสารแต่ละชนิด ควบคุมการหยิบใช้ได้ และไม่ทำให้เกิดการปนเปื้อนสู่ผลิตผลและไม่เกิดอันตรายต่อบุคคล',
            level: 'ข้อแนะนำ',
            levelNo: '3.6'
        },
        {
            id: 62,
            itemId: 9, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 7,
            name: 'ภาชนะบรรจุวัตถุอันตรายทางการเกษตรที่ใช้หมดแล้ว ต้องทำลาย หรือกำจัดด้วยวิธีที่ถูกต้อง',
            level: 'ข้อแนะนำ',
            levelNo: '3.7'
        },
        {
            id: 63,
            itemId: 9, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 8,
            name: 'ผู้ปฏิบัติงานควรมีความรู้ในการป้องกันตนเองจากการใช้วัตถุอันตรายทางการเกษตร และการปฐมพยาบาลเบื้องต้น',
            level: 'ข้อแนะนำ',
            levelNo: '3.8'
        },
        {
            id: 64,
            itemId: 9, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 9,
            name: 'มีเอกสารข้อมูลเกี่ยวกับวัตถุอันตรายทางการเกษตรที่ใช้ ห้ามใช้ในประเทศและประเทศคู่ค้า',
            level: 'ข้อแนะนำ',
            levelNo: '3.9'
        },
        {
            id: 65,
            itemId: 9, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 10,
            name: 'ไม่ใช้วัตถุอันตรายทางการเกษตรมากกว่าสองชนิดผสมกันเว้นแต่จะเป็นคำแแนะนำของหน่วยราชการที่เกี่ยวข้องหรือข้อมูลทางวิชาการรับรอง',
            level: 'ข้อแนะนำ',
            levelNo: '3.10'
        },
        {
            id: 66,
            itemId: 9, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 11,
            name: 'มีการใช้ระบบการจัดการศัตรูพืชแบบผสมผสานที่เหมาะสม',
            level: 'ข้อแนะนำ',
            levelNo: '3.11'
        },
        {
            id: 67,
            itemId: 9, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 12,
            name: 'จัดเก็บวัตถุอันตรายทางการเกษตรอื่น เช่น น้ำมันเชื้อเพลิง สารทำความสะอาด สารอื่นๆ ที่ไม่ได้ใช้ทางการเกษตร ให้เก็บเป็นสัดส่วนเพื่อป้องกันการปนเปื้อนสู่ผลิตผลและสิ่งแวดล้อม',
            level: 'ข้อแนะนำ',
            levelNo: '3.12'
        },
        {
            id: 68,
            itemId: 9, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 13,
            name: 'มีการบันทึกรายการหรือจัดทำบัญชีรายชื่อวัตถุอันตรายทางการเกษตร ที่เก็บไว้ในสถานที่เก็บ',
            level: 'ข้อแนะนำ',
            levelNo: '3.13'
        },
        {
            id: 69,
            itemId: 9, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 14,
            name: 'ผู้พ่นวัตถุอันตรายทางการเกษตรต้องอยู่เหนือลมตลอดเวลา รวมถึงต้องระวังละอองวัตถุอันตรายทางการเกษตรฟุ้งกระจายไปปนเปื้อนแปลงใกล้เคียงและสิ่งแวดล้อม',
            level: 'ข้อแนะนำ',
            levelNo: '3.14'
        },
        {
            id: 70,
            itemId: 9, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 15,
            name: 'มีเอกสารคำแนะนำการปฏิบัติกรณีที่มีอุบัติเหตุหรือเหตุฉุกเฉินแสดงไว้ให้เห็นชัดเจนในบริเวณเก็บวัตถุอันตรายทางการเกษตร',
            level: 'ข้อแนะนำ',
            levelNo: '3.15'
        },
        {
            id: 71,
            itemId: 10, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตหลังการเปิดกรีด ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 1,
            name: 'พันธุ์ยางต้องเป็นพันธุ์ที่สถาบันวิจัยยางแนะนำตั้งแต่ปี 2554 ถึงปัจจุบัน',
            level: 'ข้อกำหนดหลัก',
            levelNo: '4.1'
        },
        {
            id: 72,
            itemId: 10, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตหลังการเปิดกรีด ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 2,
            name: 'ใช้ระยะปลูกตามคำแนะนำของสถาบันวิจัยยาง',
            level: 'ข้อกำหนดหลัก',
            levelNo: '4.2'
        },
        {
            id: 73,
            itemId: 10, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตหลังการเปิดกรีด ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 3,
            name: 'การควบคุมและกำจัดวัชพืช เพื่อลดกระทบต่อการเจริญเติบโตของต้นยาง',
            level: 'ข้อกำหนดหลัก',
            levelNo: '4.3'
        },
        {
            id: 74,
            itemId: 10, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตหลังการเปิดกรีด ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 4,
            name: 'ใช้สูตรปุ๋ย และอัตราการใช้ปุ๋ยที่แนะนำสำหรับยางพารา เป็นสูตรปู่ยทั่วไปเหมาะสำหรับดินที่เป็นตัวแทนส่วนใหญ่ของประเทศ หรือใส่ปุ๋ยตามค่าวิเคราะห์ดิน',
            level: 'ข้อกำหนดหลัก',
            levelNo: '4.4'
        },
        {
            id: 75,
            itemId: 10, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตหลังการเปิดกรีด ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 5,
            name: 'ส่วนของพืชที่มีโรคเข้าทำลายต้องเผาทำลายนอกแปลงปลูก โดยไม่มีผลกระทบต่อสิ่งแวดล้อม',
            level: 'ข้อแนะนำ',
            levelNo: '4.5'
        },
        {
            id: 76,
            itemId: 10, // รายการตรวจ ที่ 4 : การจัดการคุณภาพในกระบวนการผลิตหลังการเปิดกรีด ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 6,
            name: 'แยกประเภทของเสีย และสิ่งของที่ไม่ใช้/ไม่เกี่ยวข้องกับผลิตให้ชัดเจน มีที่ทิ้งขยะเพียงพอหรือระบุจุดทิ้ง รวมถึงมีการลดของเสียที่เกิดขึ้นในกระบวนการผลิต',
            level: 'ข้อแนะนำ',
            levelNo: '4.6'
        },
        {
            id: 77,
            itemId: 11, // รายการตรวจ ที่ 5 : การเก็บเกี่ยวและการปฏิบัติหลังการเก็บเกี่ยว สำหรับผลิตน้ำยางสด ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 1,
            name: 'ขนาดของลำต้นและจำนวนต้นที่ไม่กรีด ต้องเป็นไปตามคำแนะนำของสถาบันวิจัยยาง',
            level: 'ข้อกำหนดหลัก',
            levelNo: '5.1'
        },
        {
            id: 78,
            itemId: 11, // รายการตรวจ ที่ 5 : การเก็บเกี่ยวและการปฏิบัติหลังการเก็บเกี่ยว สำหรับผลิตน้ำยางสด ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 2,
            name: 'ต้นยางมีขนาดสม่ำเสมอไม่น้อยกว่าร้อยละ 70 ของจำนวนต้นทั้งหมดในแปลงปลูก',
            level: 'ข้อกำหนดหลัก',
            levelNo: '5.2'
        },
        {
            id: 79,
            itemId: 11, // รายการตรวจ ที่ 5 : การเก็บเกี่ยวและการปฏิบัติหลังการเก็บเกี่ยว สำหรับผลิตน้ำยางสด ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 3,
            name: 'ความสูงของรอยเปิดกรีด ต้องได้ระดับตามคำแนะนำของสถาบันวิจัยยาง',
            level: 'ข้อกำหนดหลัก',
            levelNo: '5.3'
        },
        {
            id: 80,
            itemId: 11, // รายการตรวจ ที่ 5 : การเก็บเกี่ยวและการปฏิบัติหลังการเก็บเกี่ยว สำหรับผลิตน้ำยางสด ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 4,
            name: 'ใช้ระบบกรีดยางตามแนะนำของสถาบันวิจัยยาง',
            level: 'ข้อกำหนดหลัก',
            levelNo: '5.4'
        },
        {
            id: 81,
            itemId: 11, // รายการตรวจ ที่ 5 : การเก็บเกี่ยวและการปฏิบัติหลังการเก็บเกี่ยว สำหรับผลิตน้ำยางสด ของการตรวจประเมินสวนยางพาราหลังเปิดกรีดและการผลิตน้ำยางสด
            requirementNo: 5,
            name: 'ให้แบ่งหน้ากรีด 2-3 หน้ากรีด',
            level: 'ข้อกำหนดหลัก',
            levelNo: '5.5'
        },

        // ข้อกำหนดอื่นๆ...
    ];

    console.log(`Seeding requirements...`);

    for (const req of requirements) {
        await prisma.requirementMaster.upsert({
            where: { requirementId: req.id },
            update: {},
            create: {
                requirementId: req.id,
                inspectionItemId: req.itemId,
                requirementNo: req.requirementNo,
                requirementName: req.name,
                requirementLevel: req.level,
                requirementLevelNo: req.levelNo
            }
        });
    }

    console.log(`Seeded ${requirements.length} requirements`);
}