import { PrismaClient } from '@prisma/client'

export async function seedRequirements(prisma: PrismaClient) {
    // ข้อกำหนดของรายการตรวจต่างๆ
    const requirements = [
        {
            id: 1,
            itemId: 1, // รายการตรวจ ที่ 1 : น้ำ ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 1,
            name: 'หากไม่ใช่น้ำฝน ต้องมาจากแหล่งที่ไม่มีการปนเปื้อนวัตถุอันตราย',
            level: 'ข้อกำหนดรอง',
            levelNo: '1.1'
        },
        {
            id: 2,
            itemId: 1, // รายการตรวจ ที่ 1 : น้ำ ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 2,
            name: 'มีการอนุรักษ์แหล่งน้ำ และสภาพแวดล้อม',
            level: 'ข้อแนะนำ',
            levelNo: '1.2'
        },
        {
            id: 3,
            itemId: 1, // รายการตรวจ ที่ 1 : น้ำ ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 3,
            name: 'เลือกแหล่งปลูกที่มีน้ำเพียงพอในการผลิตพืชให้มีคุณภาพ',
            level: 'ข้อแนะนำ',
            levelNo: '1.3'
        },
        {
            id: 4,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 1,
            name: 'พื้นที่ปลูกไม่มีการตกค้างของวัตถุอันตรายที่ส่งผลกระทบต่อการเจริญเติบโตของต้นยาง',
            level: 'ข้อกำหนดหลัก',
            levelNo: '2.1'
        },
        {
            id: 5,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 2,
            name: 'สภาพพื้นที่เป็นพื้นที่ราบหรือมีความลาดชันต่ำกว่า 35 องศา ถ้าความลาดชันเกิน 15 องศา ต้องทำขั้นบันได ความสูงจากระดับน้ำทะเลไม่เกิน 600 เมตร',
            level: 'ข้อกำหนดหลัก',
            levelNo: '2.2'
        },
        {
            id: 6,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 3,
            name: 'หน้าดินควรมีความลึกไม่น้อยกว่า 1 เมตร ไม่เป็นพื้นที่ที่มีน้ำท่วมขัง หรือชั้นกรวดอัดแน่นในระดับต่ำกว่าผิวดิน 1 เมตร ดินมีการระบายน้ำดี',
            level: 'ข้อกำหนดหลัก',
            levelNo: '2.3'
        },
        {
            id: 7,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 4,
            name: 'ค่าความเป็นกรด - ด่าง (pH) ที่เหมาะสมอยู่ระหว่าง 4.5 - 5.5 ไม่เป็นดินเค็ม หรือดินเกลือ',
            level: 'ข้อกำหนดรอง',
            levelNo: '2.4'
        },
        {
            id: 8,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 5,
            name: 'พื้นที่ปลูกควรมีปริมาณน้ำฝนไม่ต่ำกว่า 1,200 มิลลิเมตรต่อปี จำนวนวันฝนตกเฉลี่ย 120-150 วัน และมีช่วงฤดูแล้งต่อเนื่องไม่เกิน 5 เดือน',
            level: 'ข้อกำหนดรอง',
            levelNo: '2.5'
        },
        {
            id: 9,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 6,
            name: 'พื้นที่ปลูกใหม่ ควรเป็นพื้นที่ที่ไม่ก่อให้เกิดผลกระทบต่อสิ่งแวดล้อม หากมีผลกระทบ ควรมีมาตรการในการลดหรือป้องกันผลเสียที่จะเกิดขึ้น',
            level: 'ข้อกำหนดรอง',
            levelNo: '2.6'
        },
        {
            id: 10,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 7,
            name: 'การจัดทำรหัสแปลงปลูก และข้อมูลประจำแปลง โดยระบุ ชื่อเจ้าของพื้นที่ สถานที่ติดต่อ ชื่อผู้ดูแล (ถ้ามี) ที่ติดตั้งแปลง แผนผังที่ตั้งแปลง แผนผังแปลงปลูก และพันธุ์ที่ปลูก',
            level: 'ข้อกำหนดรอง',
            levelNo: '2.7'
        },
        {
            id: 10,
            itemId: 2, // รายการตรวจ ที่ 2 : พื้นที่ปลูก ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 8,
            name: 'จัดทำประวัติการใช้ที่ดินย้อนหลังอย่างน้อย 2 ปี',
            level: 'ข้อแนะนำ',
            levelNo: '2.8'
        },
        {
            id: 11,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 1,
            name: 'ใช้วัตถุอันตรายที่ขึ้นทะเบียนถูกต้องตามกฎหมาย มีเลขทะเบียนวัตถุอันตราย และมีคำแนะนำบนฉลาก ไม่ใช้วัตถุอันตรายทางการเกษตรที่ห้ามผลิต นำเข้า ส่งออก หรือการมีไว้ในครอบครองตามพระราชบัญญัติวัตถุอันตราย พ.ศ. 2562',
            level: 'ข้อกำหนดรอง',
            levelNo: '3.1'
        },
        {
            id: 12,
            itemId: 3, // รายการตรวจ ที่ 3 : วัตถุอันตรายทางการเกษตร ของการตรวจประเมินสวนยางพาราก่อนเปิดกรีด
            requirementNo: 2,
            name: 'ทำความสะอาดเครื่องพ่นวัตถุอันตรายทางการเกษตรและอุปกรณ์หลังการใช้ทุกครั้ง และกำจัดน้ำล้างด้วยวิธีที่ไม่ทำให้เกิดการปนเปื้อนสู่สิ่งแวดล้อม',
            level: 'ข้อแนะนำ',
            levelNo: '3.2'
        },











        // ข้อกำหนดอื่นๆ...
    ];

    console.log(`Seeding requirements...`);

    for (const req of requirements) {
        await prisma.requirementMaster.upsert({
            where: { requirementId: req.id },
            update: {},
            create: {
                requirementId: req.id,
                inspectionItemId: req.itemId,
                requirementNo: req.requirementNo,
                requirementName: req.name,
                requirementLevel: req.level,
                requirementLevelNo: req.levelNo
            }
        });
    }

    console.log(`Seeded ${requirements.length} requirements`);
}